[Killed] StringLiteral
app/App.vue:39:18
 
 useHead({
   title: ANTOINE_ZANARDI_FULL_NAME,
-  meta: [{ name: "description", content: t("App.meta.description") }],
+  meta: [{ name: "", content: t("App.meta.description") }],
   htmlAttrs: { lang: locale.value },
 });
killedBy: App Component should use head for sso purposes when rendered.
statusReason: expected 1st "spy" call to have been called with [ { title: 'Antoine ZANARDI', …(2) } ]

[Killed] ObjectLiteral
app/App.vue:40:14
 useHead({
   title: ANTOINE_ZANARDI_FULL_NAME,
   meta: [{ name: "description", content: t("App.meta.description") }],
-  htmlAttrs: { lang: locale.value },
+  htmlAttrs: {},
 });
 
killedBy: App Component should use head for sso purposes when rendered.
statusReason: expected 1st "spy" call to have been called with [ { title: 'Antoine ZANARDI', …(2) } ]

[Killed] BlockStatement
app/App.vue:47:17
 
 defineOgImageComponent("DefaultOgImage");
 
-onMounted(() => {
-  aos.init();
-  const tooltipTriggerList = document.querySelectorAll("[data-bs-toggle=\"tooltip\"]");
-  // Stryker disable next-line all
-  tooltipTriggerList.forEach((tooltip: Element) => new $bootstrap.Tooltip(tooltip));
-  stampInHtml("👋 Hey ! J'ai aussi créé 💮 `dev-stamp` qui a généré ce message ! Retrouvez le sur GitHub ou npm !");
-});
+onMounted(() => {});
 </script>
killedBy: App Component should stamp a comment in HTML when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] StringLiteral
app/App.vue:49:56
 
 onMounted(() => {
   aos.init();
-  const tooltipTriggerList = document.querySelectorAll("[data-bs-toggle=\"tooltip\"]");
+  const tooltipTriggerList = document.querySelectorAll("");
   // Stryker disable next-line all
   tooltipTriggerList.forEach((tooltip: Element) => new $bootstrap.Tooltip(tooltip));
killedBy: App Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] StringLiteral
app/App.vue:52:15
   const tooltipTriggerList = document.querySelectorAll("[data-bs-toggle=\"tooltip\"]");
   // Stryker disable next-line all
   tooltipTriggerList.forEach((tooltip: Element) => new $bootstrap.Tooltip(tooltip));
-  stampInHtml("👋 Hey ! J'ai aussi créé 💮 `dev-stamp` qui a généré ce message ! Retrouvez le sur GitHub ou npm !");
+  stampInHtml(""
 });
 </script>
killedBy: App Component should stamp a comment in HTML when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "👋 Hey ! J'ai aussi créé 💮 `dev-stamp` qui a généré ce message ! Retrouvez le sur GitHub ou npm !",
], but it was called with ""
