[Killed] BlockStatement
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:194:36
 
 const config = useRuntimeConfig();
 
-const age = computed<number>(() => {
-  const birthday = new Date(ANTOINE_ZANARDI_BIRTH_DATE);
-  const epochYear = 1970;
-
-  return new Date(Date.now() - birthday.getTime()).getUTCFullYear() - epochYear;
-});
+const age = computed<number>(() => {});
 
 const formattedPhoneNumber = computed<string>(() => {
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched

[Killed] ArithmeticOperator
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:198:10
   const birthday = new Date(ANTOINE_ZANARDI_BIRTH_DATE);
   const epochYear = 1970;
 
-  return new Date(Date.now() - birthday.getTime()).getUTCFullYear() - epochYear;
+  return new Date(Date.now() - birthday.getTime()).getUTCFullYear() + epochYear;
 });
 
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched

[Killed] ArithmeticOperator
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:198:19
   const birthday = new Date(ANTOINE_ZANARDI_BIRTH_DATE);
   const epochYear = 1970;
 
-  return new Date(Date.now() - birthday.getTime()).getUTCFullYear() - epochYear;
+  return new Date(Date.now() + birthday.getTime()).getUTCFullYear() - epochYear;
 });
 
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:201:53
   return new Date(Date.now() - birthday.getTime()).getUTCFullYear() - epochYear;
 });
 
-const formattedPhoneNumber = computed<string>(() => {
-  const matches = config.public.phoneNumber.match(/.{2}/gu);
-
-  return matches ? matches.join(" ") : "?";
-});
+const formattedPhoneNumber = computed<string>(() => {});
 </script>
 
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:204:33
 const formattedPhoneNumber = computed<string>(() => {
   const matches = config.public.phoneNumber.match(/.{2}/gu);
 
-  return matches ? matches.join(" ") : "?";
+  return matches ? matches.join("") : "?";
 });
 </script>
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched
