[Killed] LogicalOperator
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:74:44
 
 const { t } = useI18n();
 
-const schoolImage = computed<string>(() => props.educationDegree.school.image ?? "college-icon.webp");
+const schoolImage = computed<string>(() => props.educationDegree.school.image && "college-icon.webp");
 
 const schoolLabel = computed<string>(() => {
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:74:38
 
 const { t } = useI18n();
 
-const schoolImage = computed<string>(() => props.educationDegree.school.image ?? "college-icon.webp");
+const schoolImage = computed<string>(() => undefined);
 
 const schoolLabel = computed<string>(() => {
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:76:44
 
 const schoolImage = computed<string>(() => props.educationDegree.school.image ?? "college-icon.webp");
 
-const schoolLabel = computed<string>(() => {
-  const { school } = props.educationDegree;
-  let label = school.translatedName ?? "?";
-  if (school.city !== undefined) {
-    label += `, ${school.city}`;
-  }
-  return label;
-});
+const schoolLabel = computed<string>(() => {});
 
 const schoolImageAlt = computed<string>(() => props.educationDegree.school.translatedName ?? "?");
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:78:15
 
 const schoolLabel = computed<string>(() => {
   const { school } = props.educationDegree;
-  let label = school.translatedName ?? "?";
+  let label = school.translatedName && "?";
   if (school.city !== undefined) {
     label += `, ${school.city}`;
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:79:7
 const schoolLabel = computed<string>(() => {
   const { school } = props.educationDegree;
   let label = school.translatedName ?? "?";
-  if (school.city !== undefined) {
+  if (school.city === undefined) {
     label += `, ${school.city}`;
   }
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:79:7
 const schoolLabel = computed<string>(() => {
   const { school } = props.educationDegree;
   let label = school.translatedName ?? "?";
-  if (school.city !== undefined) {
+  if (false) {
     label += `, ${school.city}`;
   }
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:85:41
   return label;
 });
 
-const schoolImageAlt = computed<string>(() => props.educationDegree.school.translatedName ?? "?");
+const schoolImageAlt = computed<string>(() => undefined);
 
 const periodDatesAriaLabel = computed<string>(() => {
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:85:47
   return label;
 });
 
-const schoolImageAlt = computed<string>(() => props.educationDegree.school.translatedName ?? "?");
+const schoolImageAlt = computed<string>(() => props.educationDegree.school.translatedName && "?");
 
 const periodDatesAriaLabel = computed<string>(() => {
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:87:53
 
 const schoolImageAlt = computed<string>(() => props.educationDegree.school.translatedName ?? "?");
 
-const periodDatesAriaLabel = computed<string>(() => {
-  const finishedAtYear = props.educationDegree.degree.obtainedAt.getFullYear().toString();
-
-  return t("EducationDegreeCard.degreeObtainedAtAriaLabel", {
-    degreeName: props.educationDegree.degree.name,
-    obtainedAt: finishedAtYear,
-  });
-});
+const periodDatesAriaLabel = computed<string>(() => {});
 </script>
 
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
components/MyEducation/EducationDegreeCard/EducationDegreeCard.vue:90:12
 const periodDatesAriaLabel = computed<string>(() => {
   const finishedAtYear = props.educationDegree.degree.obtainedAt.getFullYear().toString();
 
-  return t("EducationDegreeCard.degreeObtainedAtAriaLabel", {
+  return t("", {
     degreeName: props.educationDegree.degree.name,
     obtainedAt: finishedAtYear,
killedBy: Education Degree Card Component should match snapshot when rendered.
statusReason: Snapshot `Education Degree Card Component > should match snapshot when rendered. 1` mismatched
