[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:37:13
 
 const educationDegrees: EducationDegree[] = [
   {
-    degree: {
-      name: t(`Degrees.gcpACE`),
-      description: [t("MyEducation.gcpACECertification")],
-      obtainedAt: new Date("2022-12-01"),
-    },
+    degree: {},
     school: {
       ...SCHOOLS.google,
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:38:15
 const educationDegrees: EducationDegree[] = [
   {
     degree: {
-      name: t(`Degrees.gcpACE`),
+      name: t(``),
       description: [t("MyEducation.gcpACECertification")],
       obtainedAt: new Date("2022-12-01"),
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:44:25
     },
     school: {
       ...SCHOOLS.google,
-      translatedName: t(`Schools.${SCHOOLS.google.name}`),
+      translatedName: t(``),
     },
   }, {
killedBy: MyEducation Component Education Degrees should render GCP ACE education degree card when rendered.
statusReason: expected { degree: { …(3) }, school: { …(5) } } to strictly equal { degree: { …(3) }, school: { …(5) } }

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:47:13
       translatedName: t(`Schools.${SCHOOLS.google.name}`),
     },
   }, {
-    degree: {
-      name: t(`Degrees.CKAD`),
-      description: [t("MyEducation.kubernetesCertification")],
-      obtainedAt: new Date("2022-08-01"),
-    },
+    degree: {},
     school: {
       ...SCHOOLS.cloudNativeComputingFoundation,
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:48:15
     },
   }, {
     degree: {
-      name: t(`Degrees.CKAD`),
+      name: t(``),
       description: [t("MyEducation.kubernetesCertification")],
       obtainedAt: new Date("2022-08-01"),
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
app/components/MyEducation/MyEducation.vue:49:20
   }, {
     degree: {
       name: t(`Degrees.CKAD`),
-      description: [t("MyEducation.kubernetesCertification")],
+      description: [],
       obtainedAt: new Date("2022-08-01"),
     },
killedBy: MyEducation Component Education Degrees should render CKAD education degree card when rendered.
statusReason: expected { degree: { …(3) }, school: { …(5) } } to strictly equal { degree: { …(3) }, school: { …(5) } }

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:49:23
   }, {
     degree: {
       name: t(`Degrees.CKAD`),
-      description: [t("MyEducation.kubernetesCertification")],
+      description: [t("")],
       obtainedAt: new Date("2022-08-01"),
     },
killedBy: MyEducation Component Education Degrees should render CKAD education degree card when rendered.
statusReason: expected { degree: { …(3) }, school: { …(5) } } to strictly equal { degree: { …(3) }, school: { …(5) } }

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:50:28
     degree: {
       name: t(`Degrees.CKAD`),
       description: [t("MyEducation.kubernetesCertification")],
-      obtainedAt: new Date("2022-08-01"),
+      obtainedAt: new Date(""),
     },
     school: {
killedBy: MyEducation Component Education Degrees should render CKAD education degree card when rendered.
statusReason: expected { degree: { …(3) }, school: { …(5) } } to strictly equal { degree: { …(3) }, school: { …(5) } }

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:57:13
       translatedName: t(`Schools.${SCHOOLS.cloudNativeComputingFoundation.name}`),
     },
   }, {
-    degree: {
-      name: t(`Degrees.ITMasterDegree`),
-      description: [
-        t("MyEducation.firstThreeYearsInEpitech"),
-        t("MyEducation.lastYearsInEpitech"),
-      ],
-      startedAt: new Date("2014-01-01"),
-      obtainedAt: new Date("2019-01-01"),
-    },
+    degree: {},
     school: {
       ...SCHOOLS.epitech,
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:58:15
     },
   }, {
     degree: {
-      name: t(`Degrees.ITMasterDegree`),
+      name: t(``),
       description: [
         t("MyEducation.firstThreeYearsInEpitech"),
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:60:11
     degree: {
       name: t(`Degrees.ITMasterDegree`),
       description: [
-        t("MyEducation.firstThreeYearsInEpitech"),
+        t(""),
         t("MyEducation.lastYearsInEpitech"),
       ],
killedBy: MyEducation Component Education Degrees should render IT Master degree card when rendered.
statusReason: expected { degree: { …(4) }, school: { …(6) } } to strictly equal { degree: { …(4) }, school: { …(6) } }

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:61:11
       name: t(`Degrees.ITMasterDegree`),
       description: [
         t("MyEducation.firstThreeYearsInEpitech"),
-        t("MyEducation.lastYearsInEpitech"),
+        t(""),
       ],
       startedAt: new Date("2014-01-01"),
killedBy: MyEducation Component Education Degrees should render IT Master degree card when rendered.
statusReason: expected { degree: { …(4) }, school: { …(6) } } to strictly equal { degree: { …(4) }, school: { …(6) } }

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:68:25
     },
     school: {
       ...SCHOOLS.epitech,
-      translatedName: t(`Schools.${SCHOOLS.epitech.name}`),
+      translatedName: t(``),
     },
   }, {
killedBy: MyEducation Component Education Degrees should render IT Master degree card when rendered.
statusReason: expected { degree: { …(4) }, school: { …(6) } } to strictly equal { degree: { …(4) }, school: { …(6) } }

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:70:6
       ...SCHOOLS.epitech,
       translatedName: t(`Schools.${SCHOOLS.epitech.name}`),
     },
-  }, {
-    degree: {
-      name: t(`Degrees.ITCertification`),
-      description: [
-        t("MyEducation.internationalExperienceForManagement"),
-        t("MyEducation.softManagementSkills"),
-      ],
-      startedAt: new Date("2017-01-01"),
-      obtainedAt: new Date("2018-01-01"),
-    },
-    school: {
-      ...SCHOOLS.laval,
-      translatedName: t(`Schools.${SCHOOLS.laval.name}`),
-    },
-  }, {
+  }, {}, {
     degree: {
       name: t(`Degrees.highSchoolDiploma`),
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:71:13
       translatedName: t(`Schools.${SCHOOLS.epitech.name}`),
     },
   }, {
-    degree: {
-      name: t(`Degrees.ITCertification`),
-      description: [
-        t("MyEducation.internationalExperienceForManagement"),
-        t("MyEducation.softManagementSkills"),
-      ],
-      startedAt: new Date("2017-01-01"),
-      obtainedAt: new Date("2018-01-01"),
-    },
+    degree: {},
     school: {
       ...SCHOOLS.laval,
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
app/components/MyEducation/MyEducation.vue:73:20
   }, {
     degree: {
       name: t(`Degrees.ITCertification`),
-      description: [
-        t("MyEducation.internationalExperienceForManagement"),
-        t("MyEducation.softManagementSkills"),
-      ],
+      description: [],
       startedAt: new Date("2017-01-01"),
       obtainedAt: new Date("2018-01-01"),
killedBy: MyEducation Component Education Degrees should render IT certification degree card when rendered.
statusReason: expected { degree: { …(4) }, school: { …(6) } } to strictly equal { degree: { …(4) }, school: { …(6) } }

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:78:28
         t("MyEducation.softManagementSkills"),
       ],
       startedAt: new Date("2017-01-01"),
-      obtainedAt: new Date("2018-01-01"),
+      obtainedAt: new Date(""),
     },
     school: {
killedBy: MyEducation Component Education Degrees should render IT certification degree card when rendered.
statusReason: expected { degree: { …(4) }, school: { …(6) } } to strictly equal { degree: { …(4) }, school: { …(6) } }

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:80:13
       startedAt: new Date("2017-01-01"),
       obtainedAt: new Date("2018-01-01"),
     },
-    school: {
-      ...SCHOOLS.laval,
-      translatedName: t(`Schools.${SCHOOLS.laval.name}`),
-    },
+    school: {},
   }, {
     degree: {
killedBy: MyEducation Component Education Degrees should render IT certification degree card when rendered.
statusReason: expected { degree: { …(4) }, school: {} } to strictly equal { degree: { …(4) }, school: { …(6) } }

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:84:6
       ...SCHOOLS.laval,
       translatedName: t(`Schools.${SCHOOLS.laval.name}`),
     },
-  }, {
-    degree: {
-      name: t(`Degrees.highSchoolDiploma`),
-      description: [t("MyEducation.scientistHighSchoolDiploma")],
-      startedAt: new Date("2011-01-01"),
-      obtainedAt: new Date("2014-01-01"),
-    },
-    school: {
-      ...SCHOOLS.vimeu,
-      translatedName: t(`Schools.${SCHOOLS.vimeu.name}`),
-    },
-  },
+  }, {},
 ];
 
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ObjectLiteral
app/components/MyEducation/MyEducation.vue:85:13
       translatedName: t(`Schools.${SCHOOLS.laval.name}`),
     },
   }, {
-    degree: {
-      name: t(`Degrees.highSchoolDiploma`),
-      description: [t("MyEducation.scientistHighSchoolDiploma")],
-      startedAt: new Date("2011-01-01"),
-      obtainedAt: new Date("2014-01-01"),
-    },
+    degree: {},
     school: {
       ...SCHOOLS.vimeu,
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyEducation/MyEducation.vue:89:28
       name: t(`Degrees.highSchoolDiploma`),
       description: [t("MyEducation.scientistHighSchoolDiploma")],
       startedAt: new Date("2011-01-01"),
-      obtainedAt: new Date("2014-01-01"),
+      obtainedAt: new Date(""),
     },
     school: {
killedBy: MyEducation Component Education Degrees should render high school degree card when rendered.
statusReason: expected { degree: { …(4) }, school: { …(5) } } to strictly equal { degree: { …(4) }, school: { …(5) } }

[Killed] BlockStatement
app/components/MyEducation/MyEducation.vue:98:90
   },
 ];
 
-function getEducationDegreeAriaLabel(educationDegreeName: string, index: number): string {
-  return `${index + 1} - ${educationDegreeName}`;
-}
+function getEducationDegreeAriaLabel(educationDegreeName: string, index: number): string {}
 </script>
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched

[Killed] ArithmeticOperator
app/components/MyEducation/MyEducation.vue:99:13
 ];
 
 function getEducationDegreeAriaLabel(educationDegreeName: string, index: number): string {
-  return `${index + 1} - ${educationDegreeName}`;
+  return `${index - 1} - ${educationDegreeName}`;
 }
 </script>
killedBy: MyEducation Component should match snapshot when rendered.
statusReason: Snapshot `MyEducation Component > should match snapshot when rendered. 1` mismatched
