[Killed] ObjectLiteral
app/components/MyExperience/MyExperience.vue:36:3
 const { t } = useI18n();
 
 const professionalExperiences: ProfessionalExperience[] = [
-  {
-    job: {
-      name: t("MyExperience.fullStackDeveloperConsultant"),
-      description: [
-        t("MyExperience.iJoinedDaveo"),
-        t("MyExperience.whatIsConsulting"),
-        t("MyExperience.myMissionsAsConsultant"),
-        t("MyExperience.cloudProductCertifications"),
-        t("MyExperience.conferenceAndWorkshops"),
-      ],
-      startedAt: new Date("2022-04-01"),
-    },
-    company: COMPANIES.Daveo,
-  }, {
+  {}, {
     job: {
       name: t("MyExperience.itR&DEngineer"),
killedBy: My Experience Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrayDeclaration
app/components/MyExperience/MyExperience.vue:39:20
   {
     job: {
       name: t("MyExperience.fullStackDeveloperConsultant"),
-      description: [
-        t("MyExperience.iJoinedDaveo"),
-        t("MyExperience.whatIsConsulting"),
-        t("MyExperience.myMissionsAsConsultant"),
-        t("MyExperience.cloudProductCertifications"),
-        t("MyExperience.conferenceAndWorkshops"),
-      ],
+      description: [],
       startedAt: new Date("2022-04-01"),
     },
killedBy: My Experience Component Experiences should render fullstack developer experience card at Daveo when rendered.
statusReason: expected { job: { …(3) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:40:11
     job: {
       name: t("MyExperience.fullStackDeveloperConsultant"),
       description: [
-        t("MyExperience.iJoinedDaveo"),
+        t(""),
         t("MyExperience.whatIsConsulting"),
         t("MyExperience.myMissionsAsConsultant"),
killedBy: My Experience Component Experiences should render fullstack developer experience card at Daveo when rendered.
statusReason: expected { job: { …(3) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:41:11
       name: t("MyExperience.fullStackDeveloperConsultant"),
       description: [
         t("MyExperience.iJoinedDaveo"),
-        t("MyExperience.whatIsConsulting"),
+        t(""),
         t("MyExperience.myMissionsAsConsultant"),
         t("MyExperience.cloudProductCertifications"),
killedBy: My Experience Component Experiences should render fullstack developer experience card at Daveo when rendered.
statusReason: expected { job: { …(3) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:42:11
       description: [
         t("MyExperience.iJoinedDaveo"),
         t("MyExperience.whatIsConsulting"),
-        t("MyExperience.myMissionsAsConsultant"),
+        t(""),
         t("MyExperience.cloudProductCertifications"),
         t("MyExperience.conferenceAndWorkshops"),
killedBy: My Experience Component Experiences should render fullstack developer experience card at Daveo when rendered.
statusReason: expected { job: { …(3) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:43:11
         t("MyExperience.iJoinedDaveo"),
         t("MyExperience.whatIsConsulting"),
         t("MyExperience.myMissionsAsConsultant"),
-        t("MyExperience.cloudProductCertifications"),
+        t(""),
         t("MyExperience.conferenceAndWorkshops"),
       ],
killedBy: My Experience Component Experiences should render fullstack developer experience card at Daveo when rendered.
statusReason: expected { job: { …(3) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] ArrayDeclaration
app/components/MyExperience/MyExperience.vue:52:20
   }, {
     job: {
       name: t("MyExperience.itR&DEngineer"),
-      description: [
-        t("MyExperience.firstPermanentContract"),
-        t("MyExperience.asProjectManager"),
-        t("MyExperience.softSkills"),
-        t("MyExperience.expertiseAndTechnicalSkills"),
-      ],
+      description: [],
       startedAt: new Date("2019-09-01"),
       finishedAt: new Date("2022-03-31"),
killedBy: My Experience Component Experiences should render it engineer at OhMyCode when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { company: { …(3) }, job: { …(4) } }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:66:27
     job: {
       name: t("MyExperience.internFullStackDeveloper"),
       description: [t("MyExperience.distributionProject"), t("MyExperience.thisFinalInternship")],
-      startedAt: new Date("2018-09-01"),
+      startedAt: new Date(""),
       finishedAt: new Date("2019-08-30"),
     },
killedBy: My Experience Component Experiences should render second intern at OhMyCode when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { company: { …(3) }, job: { …(4) } }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:72:15
     company: COMPANIES.OhMyCode,
   }, {
     job: {
-      name: t("MyExperience.internFullStackDeveloper"),
+      name: t(""),
       description: [t("MyExperience.firstStepsInOhMyCode"), t("MyExperience.allFunctionalitiesInOnApp")],
       startedAt: new Date("2016-09-01"),
killedBy: My Experience Component should match snapshot when rendered.
statusReason: Snapshot `My Experience Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:73:23
   }, {
     job: {
       name: t("MyExperience.internFullStackDeveloper"),
-      description: [t("MyExperience.firstStepsInOhMyCode"), t("MyExperience.allFunctionalitiesInOnApp")],
+      description: [t(""), t("MyExperience.allFunctionalitiesInOnApp")],
       startedAt: new Date("2016-09-01"),
       finishedAt: new Date("2017-04-30"),
killedBy: My Experience Component Experiences should render first intern at OhMyCode when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { company: { …(3) }, job: { …(4) } }

[Killed] ArrayDeclaration
app/components/MyExperience/MyExperience.vue:73:20
   }, {
     job: {
       name: t("MyExperience.internFullStackDeveloper"),
-      description: [t("MyExperience.firstStepsInOhMyCode"), t("MyExperience.allFunctionalitiesInOnApp")],
+      description: [],
       startedAt: new Date("2016-09-01"),
       finishedAt: new Date("2017-04-30"),
killedBy: My Experience Component Experiences should render first intern at OhMyCode when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { company: { …(3) }, job: { …(4) } }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:75:28
       name: t("MyExperience.internFullStackDeveloper"),
       description: [t("MyExperience.firstStepsInOhMyCode"), t("MyExperience.allFunctionalitiesInOnApp")],
       startedAt: new Date("2016-09-01"),
-      finishedAt: new Date("2017-04-30"),
+      finishedAt: new Date(""),
     },
     company: COMPANIES.OhMyCode,
killedBy: My Experience Component Experiences should render first intern at OhMyCode when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { company: { …(3) }, job: { …(4) } }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:80:15
     company: COMPANIES.OhMyCode,
   }, {
     job: {
-      name: t("MyExperience.freelanceFullStackDeveloper"),
+      name: t(""),
       description: [t("MyExperience.reiterateAsFreelance"), t("MyExperience.moreResponsibilities")],
       startedAt: new Date("2016-02-01"),
killedBy: My Experience Component should match snapshot when rendered.
statusReason: Snapshot `My Experience Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:81:63
   }, {
     job: {
       name: t("MyExperience.freelanceFullStackDeveloper"),
-      description: [t("MyExperience.reiterateAsFreelance"), t("MyExperience.moreResponsibilities")],
+      description: [t("MyExperience.reiterateAsFreelance"), t("")],
       startedAt: new Date("2016-02-01"),
       finishedAt: new Date("2016-08-30"),
killedBy: My Experience Component Experiences should render freelance developer at SoBook when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] StringLiteral
app/components/MyExperience/MyExperience.vue:81:23
   }, {
     job: {
       name: t("MyExperience.freelanceFullStackDeveloper"),
-      description: [t("MyExperience.reiterateAsFreelance"), t("MyExperience.moreResponsibilities")],
+      description: [t(""), t("MyExperience.moreResponsibilities")],
       startedAt: new Date("2016-02-01"),
       finishedAt: new Date("2016-08-30"),
killedBy: My Experience Component Experiences should render freelance developer at SoBook when rendered.
statusReason: expected { job: { …(4) }, company: { …(3) } } to strictly equal { …(2) }

[Killed] ObjectLiteral
app/components/MyExperience/MyExperience.vue:86:6
       finishedAt: new Date("2016-08-30"),
     },
     company: COMPANIES.SoBook,
-  }, {
-    job: {
-      name: t("MyExperience.internFullStackDeveloper"),
-      description: [t("MyExperience.firstInternship")],
-      startedAt: new Date("2015-07-01"),
-      finishedAt: new Date("2015-12-31"),
-    },
-    company: COMPANIES.SoBook,
-  },
+  }, {},
 ];
 
killedBy: My Experience Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] BlockStatement
app/components/MyExperience/MyExperience.vue:97:73
   },
 ];
 
-function getExperienceAriaLabel(jobName: string, index: number): string {
-  return `${index + 1} - ${jobName}`;
-}
+function getExperienceAriaLabel(jobName: string, index: number): string {}
 </script>
killedBy: My Experience Component should match snapshot when rendered.
statusReason: Snapshot `My Experience Component > should match snapshot when rendered. 1` mismatched

[Killed] ArithmeticOperator
app/components/MyExperience/MyExperience.vue:98:13
 ];
 
 function getExperienceAriaLabel(jobName: string, index: number): string {
-  return `${index + 1} - ${jobName}`;
+  return `${index - 1} - ${jobName}`;
 }
 </script>
killedBy: My Experience Component should match snapshot when rendered.
statusReason: Snapshot `My Experience Component > should match snapshot when rendered. 1` mismatched
