[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:50:25
 const { t } = useI18n();
 const { url: siteUrl } = useSiteConfig();
 
-const i18nProjectPath = "MyPortfolio.projects";
+const i18nProjectPath = "";
 const projects: Project[] = [
   {
killedBy: My Portfolio Component Projects should render my portfolio project when rendered.
statusReason: expected { name: '.portfolio.name', …(3) } to strictly equal { …(4) }

[Killed] ObjectLiteral
app/components/MyPortfolio/MyPortfolio.vue:52:3
 
 const i18nProjectPath = "MyPortfolio.projects";
 const projects: Project[] = [
-  {
-    name: t(`${i18nProjectPath}.portfolio.name`),
-    description: t(`${i18nProjectPath}.portfolio.description`),
-    image: "portfolio-thumbnail.webp",
-    url: siteUrl,
-  },
+  {},
   {
     name: t(`${i18nProjectPath}.werewolvesAssistant.name`),
killedBy: My Portfolio Component Projects should render my portfolio project when rendered.
statusReason: expected {} to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:53:13
 const i18nProjectPath = "MyPortfolio.projects";
 const projects: Project[] = [
   {
-    name: t(`${i18nProjectPath}.portfolio.name`),
+    name: t(``),
     description: t(`${i18nProjectPath}.portfolio.description`),
     image: "portfolio-thumbnail.webp",
killedBy: My Portfolio Component Projects should render my portfolio project when rendered.
statusReason: expected { name: '', …(3) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:54:20
 const projects: Project[] = [
   {
     name: t(`${i18nProjectPath}.portfolio.name`),
-    description: t(`${i18nProjectPath}.portfolio.description`),
+    description: t(``),
     image: "portfolio-thumbnail.webp",
     url: siteUrl,
killedBy: My Portfolio Component Projects should render my portfolio project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] ObjectLiteral
app/components/MyPortfolio/MyPortfolio.vue:58:3
     image: "portfolio-thumbnail.webp",
     url: siteUrl,
   },
-  {
-    name: t(`${i18nProjectPath}.werewolvesAssistant.name`),
-    description: t(`${i18nProjectPath}.werewolvesAssistant.description`),
-    image: "werewolves-assistant-thumbnail.webp",
-    url: "https://werewolves-assistant.com",
-  },
+  {},
   {
     name: t(`${i18nProjectPath}.distribution.name`),
killedBy: My Portfolio Component Projects should render my Werewolves Assistant project when rendered.
statusReason: expected {} to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:61:12
   {
     name: t(`${i18nProjectPath}.werewolvesAssistant.name`),
     description: t(`${i18nProjectPath}.werewolvesAssistant.description`),
-    image: "werewolves-assistant-thumbnail.webp",
+    image: "",
     url: "https://werewolves-assistant.com",
   },
killedBy: My Portfolio Component Projects should render my Werewolves Assistant project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:66:20
   },
   {
     name: t(`${i18nProjectPath}.distribution.name`),
-    description: t(`${i18nProjectPath}.distribution.description`),
+    description: t(``),
     image: "distribution-thumbnail.webp",
     url: "https://www.airvey-editions.fr",
killedBy: My Portfolio Component Projects should render book distribution project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:68:10
     name: t(`${i18nProjectPath}.distribution.name`),
     description: t(`${i18nProjectPath}.distribution.description`),
     image: "distribution-thumbnail.webp",
-    url: "https://www.airvey-editions.fr",
+    url: "",
   },
   {
killedBy: My Portfolio Component Projects should render book distribution project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] ObjectLiteral
app/components/MyPortfolio/MyPortfolio.vue:70:3
     image: "distribution-thumbnail.webp",
     url: "https://www.airvey-editions.fr",
   },
-  {
-    name: t(`${i18nProjectPath}.gitHub.name`),
-    description: t(`${i18nProjectPath}.gitHub.description`),
-    image: "github.webp",
-    url: ANTOINE_ZANARDI_GITHUB_URL,
-  },
+  {},
 ];
 </script>
killedBy: My Portfolio Component Projects should render my GitHub profile project when rendered.
statusReason: expected {} to strictly equal { …(4) }
