[Killed] StringLiteral
app/components/MySkills/MySkills.vue:79:17
 
 const { t } = useI18n();
 
-const htmlUrl = "https://fr.wikipedia.org/wiki/HTML5";
+const htmlUrl = "";
 const cssUrl = "https://fr.wikipedia.org/wiki/Feuilles_de_style_en_cascade";
 const jsUrl = "https://fr.wikipedia.org/wiki/JavaScript";
killedBy: My Skills Component Skills 'should render HTML skill when rendere…'
statusReason: expected { name: 'MySkills.html', …(4) } to strictly equal { name: 'MySkills.html', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:81:15
 
 const htmlUrl = "https://fr.wikipedia.org/wiki/HTML5";
 const cssUrl = "https://fr.wikipedia.org/wiki/Feuilles_de_style_en_cascade";
-const jsUrl = "https://fr.wikipedia.org/wiki/JavaScript";
+const jsUrl = "";
 const tsUrl = "https://www.typescriptlang.org/";
 const vueUrl = "https://vuejs.org/";
killedBy: My Skills Component Skills 'should render JavaScript skill when r…'
statusReason: expected { name: 'MySkills.javascript', …(4) } to strictly equal { name: 'MySkills.javascript', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:84:17
 const jsUrl = "https://fr.wikipedia.org/wiki/JavaScript";
 const tsUrl = "https://www.typescriptlang.org/";
 const vueUrl = "https://vuejs.org/";
-const nuxtUrl = "https://v3.nuxtjs.org/";
+const nuxtUrl = "";
 const mysqlUrl = "https://www.mysql.com/fr/";
 const mongodbUrl = "https://www.mongodb.com/";
killedBy: My Skills Component Skills 'should render Nuxt.js skill when rend…'
statusReason: expected { name: 'MySkills.nuxt', …(4) } to strictly equal { name: 'MySkills.nuxt', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:93:14
     name: t("MySkills.html"),
     iconClasses: "fab fa-html5",
     color: "#E44D27",
-    percent: "95%",
+    percent: "",
     url: htmlUrl,
   },
killedBy: My Skills Component Skills 'should render HTML skill when rendere…'
statusReason: expected { name: 'MySkills.html', …(4) } to strictly equal { name: 'MySkills.html', …(4) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:96:3
     percent: "95%",
     url: htmlUrl,
   },
-  {
-    name: t("MySkills.css"),
-    iconClasses: "fab fa-css3-alt",
-    color: "#0162B0",
-    percent: "90%",
-    url: cssUrl,
-  },
+  {},
   {
     name: t("MySkills.javascript"),
killedBy: My Skills Component Skills 'should render CSS skill when rendered.'
statusReason: expected {} to strictly equal { name: 'MySkills.css', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:97:13
     url: htmlUrl,
   },
   {
-    name: t("MySkills.css"),
+    name: t(""),
     iconClasses: "fab fa-css3-alt",
     color: "#0162B0",
killedBy: My Skills Component Skills 'should render CSS skill when rendered.'
statusReason: expected { name: '', …(4) } to strictly equal { name: 'MySkills.css', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:98:18
   },
   {
     name: t("MySkills.css"),
-    iconClasses: "fab fa-css3-alt",
+    iconClasses: "",
     color: "#0162B0",
     percent: "90%",
killedBy: My Skills Component Skills 'should render CSS skill when rendered.'
statusReason: expected { name: 'MySkills.css', …(4) } to strictly equal { name: 'MySkills.css', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:100:14
     name: t("MySkills.css"),
     iconClasses: "fab fa-css3-alt",
     color: "#0162B0",
-    percent: "90%",
+    percent: "",
     url: cssUrl,
   },
killedBy: My Skills Component Skills 'should render CSS skill when rendered.'
statusReason: expected { name: 'MySkills.css', …(4) } to strictly equal { name: 'MySkills.css', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:104:13
     url: cssUrl,
   },
   {
-    name: t("MySkills.javascript"),
+    name: t(""),
     iconClasses: "fab fa-js",
     color: "#EFC624",
killedBy: My Skills Component Skills 'should render JavaScript skill when r…'
statusReason: expected { name: '', …(4) } to strictly equal { name: 'MySkills.javascript', …(4) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:110:3
     percent: "95%",
     url: jsUrl,
   },
-  {
-    name: t("MySkills.typescript"),
-    iconClasses: "fas fa-rocket",
-    color: "#3077C6",
-    percent: "85%",
-    url: tsUrl,
-  },
+  {},
   {
     name: t("MySkills.vue"),
killedBy: My Skills Component Skills 'should render TypeScript skill when r…'
statusReason: expected {} to strictly equal { name: 'MySkills.typescript', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:113:12
   {
     name: t("MySkills.typescript"),
     iconClasses: "fas fa-rocket",
-    color: "#3077C6",
+    color: "",
     percent: "85%",
     url: tsUrl,
killedBy: My Skills Component Skills 'should render TypeScript skill when r…'
statusReason: expected { name: 'MySkills.typescript', …(4) } to strictly equal { name: 'MySkills.typescript', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:119:18
   },
   {
     name: t("MySkills.vue"),
-    iconClasses: "fab fa-vuejs",
+    iconClasses: "",
     color: "#38956A",
     percent: "95%",
killedBy: My Skills Component Skills 'should render Vue.js skill when rende…'
statusReason: expected { name: 'MySkills.vue', …(4) } to strictly equal { name: 'MySkills.vue', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:126:18
   },
   {
     name: t("MySkills.nuxt"),
-    iconClasses: "fas fa-mountain-sun",
+    iconClasses: "",
     color: "#00DC81",
     percent: "90%",
killedBy: My Skills Component Skills 'should render Nuxt.js skill when rend…'
statusReason: expected { name: 'MySkills.nuxt', …(4) } to strictly equal { name: 'MySkills.nuxt', …(4) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:131:3
     percent: "90%",
     url: nuxtUrl,
   },
-  {
-    name: t("MySkills.mysql"),
-    iconClasses: "fas fa-database",
-    color: "#017395",
-    percent: "85%",
-    url: mysqlUrl,
-  },
+  {},
   {
     name: t("MySkills.mongodb"),
killedBy: My Skills Component Skills 'should render MySQL skill when render…'
statusReason: expected {} to strictly equal { name: 'MySkills.mysql', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:132:13
     url: nuxtUrl,
   },
   {
-    name: t("MySkills.mysql"),
+    name: t(""),
     iconClasses: "fas fa-database",
     color: "#017395",
killedBy: My Skills Component Skills 'should render MySQL skill when render…'
statusReason: expected { name: '', …(4) } to strictly equal { name: 'MySkills.mysql', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:133:18
   },
   {
     name: t("MySkills.mysql"),
-    iconClasses: "fas fa-database",
+    iconClasses: "",
     color: "#017395",
     percent: "85%",
killedBy: My Skills Component Skills 'should render MySQL skill when render…'
statusReason: expected { name: 'MySkills.mysql', …(4) } to strictly equal { name: 'MySkills.mysql', …(4) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:138:3
     percent: "85%",
     url: mysqlUrl,
   },
-  {
-    name: t("MySkills.mongodb"),
-    iconClasses: "fas fa-leaf",
-    color: "#4E9445",
-    percent: "90%",
-    url: mongodbUrl,
-  },
+  {},
   {
     name: t("MySkills.rust"),
killedBy: My Skills Component Skills 'should render MongoDB skill when rend…'
statusReason: expected {} to strictly equal { name: 'MySkills.mongodb', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:140:18
   },
   {
     name: t("MySkills.mongodb"),
-    iconClasses: "fas fa-leaf",
+    iconClasses: "",
     color: "#4E9445",
     percent: "90%",
killedBy: My Skills Component Skills 'should render MongoDB skill when rend…'
statusReason: expected { name: 'MySkills.mongodb', …(4) } to strictly equal { name: 'MySkills.mongodb', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:141:12
   {
     name: t("MySkills.mongodb"),
     iconClasses: "fas fa-leaf",
-    color: "#4E9445",
+    color: "",
     percent: "90%",
     url: mongodbUrl,
killedBy: My Skills Component Skills 'should render MongoDB skill when rend…'
statusReason: expected { name: 'MySkills.mongodb', …(4) } to strictly equal { name: 'MySkills.mongodb', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:146:13
     url: mongodbUrl,
   },
   {
-    name: t("MySkills.rust"),
+    name: t(""),
     iconClasses: "fab fa-rust",
     color: "#E3884F",
killedBy: My Skills Component Skills 'should render Rust skill when rendere…'
statusReason: expected { name: '', …(4) } to strictly equal { name: 'MySkills.rust', …(4) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:148:12
   {
     name: t("MySkills.rust"),
     iconClasses: "fab fa-rust",
-    color: "#E3884F",
+    color: "",
     percent: "60%",
     url: rustUrl,
killedBy: My Skills Component Skills 'should render Rust skill when rendere…'
statusReason: expected { name: 'MySkills.rust', …(4) } to strictly equal { name: 'MySkills.rust', …(4) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:160:3
     iconClasses: "fab fa-linux",
     color: "#2C2C2C",
   },
-  {
-    description: t("MySkills.microServicesArchitecture"),
-    iconClasses: "fas fa-sitemap",
-    color: "#007EB8",
-  },
+  {},
   {
     description: t("MySkills.gitForVersionControl"),
killedBy: My Skills Component Tools 'should render Microservices skill whe…'
statusReason: expected {} to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:161:20
     color: "#2C2C2C",
   },
   {
-    description: t("MySkills.microServicesArchitecture"),
+    description: t(""),
     iconClasses: "fas fa-sitemap",
     color: "#007EB8",
killedBy: My Skills Component Tools 'should render Microservices skill whe…'
statusReason: expected { description: '', …(2) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:163:12
   {
     description: t("MySkills.microServicesArchitecture"),
     iconClasses: "fas fa-sitemap",
-    color: "#007EB8",
+    color: "",
   },
   {
killedBy: My Skills Component Tools 'should render Microservices skill whe…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:165:3
     iconClasses: "fas fa-sitemap",
     color: "#007EB8",
   },
-  {
-    description: t("MySkills.gitForVersionControl"),
-    iconClasses: "fab fa-git",
-    color: "#F05033",
-  },
+  {},
   {
     description: t("MySkills.multipleEnvs"),
killedBy: My Skills Component Tools 'should render Git skill when rendered.'
statusReason: expected {} to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:167:18
   },
   {
     description: t("MySkills.gitForVersionControl"),
-    iconClasses: "fab fa-git",
+    iconClasses: "",
     color: "#F05033",
   },
killedBy: My Skills Component Tools 'should render Git skill when rendered.'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:171:20
     color: "#F05033",
   },
   {
-    description: t("MySkills.multipleEnvs"),
+    description: t(""),
     iconClasses: "fas fa-code-branch",
     color: "#6C757D",
killedBy: My Skills Component Tools 'should render code branch skills when…'
statusReason: expected { description: '', …(2) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:172:18
   },
   {
     description: t("MySkills.multipleEnvs"),
-    iconClasses: "fas fa-code-branch",
+    iconClasses: "",
     color: "#6C757D",
   },
killedBy: My Skills Component Tools 'should render code branch skills when…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:175:3
     iconClasses: "fas fa-code-branch",
     color: "#6C757D",
   },
-  {
-    description: t("MySkills.gitHubAndActions"),
-    iconClasses: "fab fa-github ",
-    color: "#000000",
-  },
+  {},
   {
     description: t("MySkills.nodeJsForProjects"),
killedBy: My Skills Component Tools 'should render GitHub Actions skills w…'
statusReason: expected {} to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:178:12
   {
     description: t("MySkills.gitHubAndActions"),
     iconClasses: "fab fa-github ",
-    color: "#000000",
+    color: "",
   },
   {
killedBy: My Skills Component Tools 'should render GitHub Actions skills w…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:192:18
   },
   {
     description: t("MySkills.vueJsWithNuxt"),
-    iconClasses: "fab fa-vuejs",
+    iconClasses: "",
     color: "#38956A",
   },
killedBy: My Skills Component Tools 'should render VueJS skills when rende…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:193:12
   {
     description: t("MySkills.vueJsWithNuxt"),
     iconClasses: "fab fa-vuejs",
-    color: "#38956A",
+    color: "",
   },
   {
killedBy: My Skills Component Tools 'should render VueJS skills when rende…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:195:3
     iconClasses: "fab fa-vuejs",
     color: "#38956A",
   },
-  {
-    description: t("MySkills.openSourceNpm"),
-    iconClasses: "fab fa-npm",
-    color: "#C63635",
-  },
+  {},
   {
     description: t("MySkills.esLintForGoodPractises"),
killedBy: My Skills Component Tools 'should render NPM skills when rendere…'
statusReason: expected {} to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:198:12
   {
     description: t("MySkills.openSourceNpm"),
     iconClasses: "fab fa-npm",
-    color: "#C63635",
+    color: "",
   },
   {
killedBy: My Skills Component Tools 'should render NPM skills when rendere…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] ObjectLiteral
app/components/MySkills/MySkills.vue:200:3
     iconClasses: "fab fa-npm",
     color: "#C63635",
   },
-  {
-    description: t("MySkills.esLintForGoodPractises"),
-    iconClasses: "fas fa-spell-check",
-    color: "#00B819",
-  },
+  {},
   {
     description: t("MySkills.unitTests"),
killedBy: My Skills Component Tools 'should render ESLint skills when rend…'
statusReason: expected {} to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:201:20
     color: "#C63635",
   },
   {
-    description: t("MySkills.esLintForGoodPractises"),
+    description: t(""),
     iconClasses: "fas fa-spell-check",
     color: "#00B819",
killedBy: My Skills Component Tools 'should render ESLint skills when rend…'
statusReason: expected { description: '', …(2) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:202:18
   },
   {
     description: t("MySkills.esLintForGoodPractises"),
-    iconClasses: "fas fa-spell-check",
+    iconClasses: "",
     color: "#00B819",
   },
killedBy: My Skills Component Tools 'should render ESLint skills when rend…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:211:20
     color: "#35485E",
   },
   {
-    description: t("MySkills.openSource"),
+    description: t(""),
     iconClasses: "fas fa-hand-holding-heart",
     color: "#C41B1B",
killedBy: My Skills Component Tools 'should render Open Source skills when…'
statusReason: expected { description: '', …(2) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:212:18
   },
   {
     description: t("MySkills.openSource"),
-    iconClasses: "fas fa-hand-holding-heart",
+    iconClasses: "",
     color: "#C41B1B",
   },
killedBy: My Skills Component Tools 'should render Open Source skills when…'
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] StringLiteral
app/components/MySkills/MySkills.vue:218:12
   {
     description: t("MySkills.docker"),
     iconClasses: "fab fa-docker",
-    color: "#2F87E3",
+    color: "",
   },
 ];
killedBy: My Skills Component Tools 'should render Docker skills when rend…'
statusReason: expected { Object (description, iconClasses, ...) } to strictly equal { Object (description, iconClasses, ...) }
