[Killed] ArrowFunction
components/MySkills/SkillProgressBar/SkillProgressBar.vue:56:59
 
 const { t } = useI18n();
 
-const progressBarStyle = computed<Record<string, string>>(() => ({
-  width: props.skill.percent,
-  backgroundColor: props.skill.color,
-}));
+const progressBarStyle = computed<Record<string, string>>(() => undefined);
 
 const progressBarAriaLabel = computed<string>(() => t("SkillProgressBar.skillProgress", {
killedBy: Skill Progress Bar Component should match snapshot when rendered.
statusReason: Snapshot `Skill Progress Bar Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
components/MySkills/SkillProgressBar/SkillProgressBar.vue:61:47
   backgroundColor: props.skill.color,
 }));
 
-const progressBarAriaLabel = computed<string>(() => t("SkillProgressBar.skillProgress", {
-  skillName: props.skill.name,
-  skillPercent: props.skill.percent,
-}));
+const progressBarAriaLabel = computed<string>(() => undefined);
 </script>
killedBy: Skill Progress Bar Component should match snapshot when rendered.
statusReason: Snapshot `Skill Progress Bar Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
components/MySkills/SkillProgressBar/SkillProgressBar.vue:61:55
   backgroundColor: props.skill.color,
 }));
 
-const progressBarAriaLabel = computed<string>(() => t("SkillProgressBar.skillProgress", {
+const progressBarAriaLabel = computed<string>(() => t("", {
   skillName: props.skill.name,
   skillPercent: props.skill.percent,
killedBy: Skill Progress Bar Component should match snapshot when rendered.
statusReason: Snapshot `Skill Progress Bar Component > should match snapshot when rendered. 1` mismatched
