[Killed] BooleanLiteral
app/components/NavBar/NavBar.vue:101:46
 <script lang="ts" setup>
 import { ANTOINE_ZANARDI_FULL_NAME } from "~/shared/constants/antoine-zanardi.constants";
 
-const isMobileNavBarCollapsed = ref<boolean>(true);
+const isMobileNavBarCollapsed = ref<boolean>(false);
 
 function onClickFromNavBarToggler(): void {
killedBy: NavBar Component should match snapshot when rendered.
statusReason: Snapshot `NavBar Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
app/components/NavBar/NavBar.vue:103:43
 
 const isMobileNavBarCollapsed = ref<boolean>(true);
 
-function onClickFromNavBarToggler(): void {
-  isMobileNavBarCollapsed.value = !isMobileNavBarCollapsed.value;
-}
+function onClickFromNavBarToggler(): void {}
 
 function onClickFromNavBarLink(): void {
killedBy: NavBar Component Navigation should toggle show class when clicked on a navbar toggler.
statusReason: expected [ 'collapse', …(2) ] to include 'show'

[Killed] BooleanLiteral
app/components/NavBar/NavBar.vue:104:35
 const isMobileNavBarCollapsed = ref<boolean>(true);
 
 function onClickFromNavBarToggler(): void {
-  isMobileNavBarCollapsed.value = !isMobileNavBarCollapsed.value;
+  isMobileNavBarCollapsed.value = isMobileNavBarCollapsed.value;
 }
 
killedBy: NavBar Component Navigation should toggle show class when clicked on a navbar toggler.
statusReason: expected [ 'collapse', …(2) ] to include 'show'

[Killed] BlockStatement
app/components/NavBar/NavBar.vue:107:40
   isMobileNavBarCollapsed.value = !isMobileNavBarCollapsed.value;
 }
 
-function onClickFromNavBarLink(): void {
-  isMobileNavBarCollapsed.value = true;
-}
+function onClickFromNavBarLink(): void {}
 </script>
 
killedBy: NavBar Component Navigation should remove show class when clicked on a nav link after toggling.
statusReason: expected [ 'collapse', …(3) ] to not include 'show'

[Killed] BooleanLiteral
app/components/NavBar/NavBar.vue:108:35
 }
 
 function onClickFromNavBarLink(): void {
-  isMobileNavBarCollapsed.value = true;
+  isMobileNavBarCollapsed.value = false;
 }
 </script>
killedBy: NavBar Component Navigation should remove show class when clicked on a nav link after toggling.
statusReason: expected [ 'collapse', …(3) ] to not include 'show'
