[Killed] StringLiteral
app/components/OgImage/DefaultOgImage.vue:40:15
 import { ANTOINE_ZANARDI_FULL_NAME } from "~/shared/constants/antoine-zanardi.constants";
 
 const headingStyles = {
-  textShadow: "0px 1px 2px rgba(13, 79, 22, 1), 0px 3px 2px rgba(13, 79, 22, 1), 0px 4px 8px rgba(13, 79, 22, 1)",
+  textShadow: "",
 };
 </script>
killedBy: Default Og Image Component should match snapshot when rendered.
statusReason: Snapshot `Default Og Image Component > should match snapshot when rendered. 1` mismatched
