[Killed] ArrowFunction
app/components/PageFooter/PageFooter.vue:30:35
 import LinkedInButton from "~/components/shared/Buttons/LinkedInButton.vue";
 import { ANTOINE_ZANARDI_FULL_NAME } from "~/shared/constants/antoine-zanardi.constants";
 
-const fullYear = computed<number>(() => new Date().getFullYear());
+const fullYear = computed<number>(() => undefined);
 </script>
killedBy: Page Footer Component should match snapshot when rendered.
statusReason: Snapshot `Page Footer Component > should match snapshot when rendered. 1` mismatched
