[Killed] BlockStatement
shared/Images/CountryFlag/CountryFlag.vue:20:47
 
 const props = defineProps<CountryFlagProps>();
 
-const countryFlagSrc = computed<string>(() => {
-  const countryFlagsSrc: Record<Country, string> = {
-    france: "france-flag.webp",
-    usa: "usa-flag.webp",
-    canada: "canada-flag.webp",
-  };
-
-  return countryFlagsSrc[props.country];
-});
+const countryFlagSrc = computed<string>(() => {});
 </script>
 
killedBy: Country Flag Component should match snapshot when rendered.
statusReason: Snapshot `Country Flag Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
shared/Images/CountryFlag/CountryFlag.vue:21:52
 const props = defineProps<CountryFlagProps>();
 
 const countryFlagSrc = computed<string>(() => {
-  const countryFlagsSrc: Record<Country, string> = {
-    france: "france-flag.webp",
-    usa: "usa-flag.webp",
-    canada: "canada-flag.webp",
-  };
+  const countryFlagsSrc: Record<Country, string> = {};
 
   return countryFlagsSrc[props.country];
killedBy: Country Flag Component should match snapshot when rendered.
statusReason: Snapshot `Country Flag Component > should match snapshot when rendered. 1` mismatched
