[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:86:48
 const { t } = useI18n();
 const { getMonthFullName } = useDates();
 
-const formattedPeriod = computed<string>(() => {
-  if (!props.startedAt) {
-    return "";
-  }
-  const finishedAt = props.finishedAt ?? new Date();
-  const period = new Period(props.startedAt, finishedAt);
-  let periodText = "";
-  if (period.year) {
-    periodText += t("shared.years", { yearCount: period.year }, period.year);
-  }
-  if (!props.doesShowYearOnly) {
-    if (period.month && period.year) {
-      periodText += ` ${t("shared.and")} `;
-    }
-    if (period.month) {
-      periodText += t("shared.months", { monthCount: period.month });
-    }
-  }
-  return `( ${periodText} )`;
-});
+const formattedPeriod = computed<string>(() => {});
 
 const formattedStartedAt = computed<string>(() => {
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:87:7
 const { getMonthFullName } = useDates();
 
 const formattedPeriod = computed<string>(() => {
-  if (!props.startedAt) {
+  if (true) {
     return "";
   }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] BooleanLiteral
components/shared/Period/PeriodTimeline.vue:87:7
 const { getMonthFullName } = useDates();
 
 const formattedPeriod = computed<string>(() => {
-  if (!props.startedAt) {
+  if (props.startedAt) {
     return "";
   }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] StringLiteral
components/shared/Period/PeriodTimeline.vue:88:12
 
 const formattedPeriod = computed<string>(() => {
   if (!props.startedAt) {
-    return "";
+    return "Stryker was here!";
   }
   const finishedAt = props.finishedAt ?? new Date();
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
components/shared/Period/PeriodTimeline.vue:90:22
   if (!props.startedAt) {
     return "";
   }
-  const finishedAt = props.finishedAt ?? new Date();
+  const finishedAt = props.finishedAt && new Date();
   const period = new Period(props.startedAt, finishedAt);
   let periodText = "";
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] StringLiteral
components/shared/Period/PeriodTimeline.vue:92:20
   }
   const finishedAt = props.finishedAt ?? new Date();
   const period = new Period(props.startedAt, finishedAt);
-  let periodText = "";
+  let periodText = "Stryker was here!";
   if (period.year) {
     periodText += t("shared.years", { yearCount: period.year }, period.year);
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:93:7
   const finishedAt = props.finishedAt ?? new Date();
   const period = new Period(props.startedAt, finishedAt);
   let periodText = "";
-  if (period.year) {
+  if (false) {
     periodText += t("shared.years", { yearCount: period.year }, period.year);
   }
killedBy: Period Timeline Component Periods Period should display period formatted label when started at and finished at are provided in props.
statusReason: expected '(  shared.and shared.months, {"monthC…' to be '( shared.years, {"yearCount":2}, 2 sh…' // Object.is equality

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:93:7
   const finishedAt = props.finishedAt ?? new Date();
   const period = new Period(props.startedAt, finishedAt);
   let periodText = "";
-  if (period.year) {
+  if (true) {
     periodText += t("shared.years", { yearCount: period.year }, period.year);
   }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] AssignmentOperator
components/shared/Period/PeriodTimeline.vue:94:5
   const period = new Period(props.startedAt, finishedAt);
   let periodText = "";
   if (period.year) {
-    periodText += t("shared.years", { yearCount: period.year }, period.year);
+    periodText -= t("shared.years", {
+  yearCount: period.year
+}, period.year);
   }
   if (!props.doesShowYearOnly) {
killedBy: Period Timeline Component Periods Period should display period formatted label when started at and finished at are provided in props.
statusReason: expected '( NaN shared.and shared.months, {"mon…' to be '( shared.years, {"yearCount":2}, 2 sh…' // Object.is equality

[Killed] StringLiteral
components/shared/Period/PeriodTimeline.vue:94:21
   const period = new Period(props.startedAt, finishedAt);
   let periodText = "";
   if (period.year) {
-    periodText += t("shared.years", { yearCount: period.year }, period.year);
+    periodText += t("", { yearCount: period.year }, period.year);
   }
   if (!props.doesShowYearOnly) {
killedBy: Period Timeline Component Periods Period should display period formatted label when started at and finished at are provided in props.
statusReason: expected '( , {"yearCount":2}, 2 shared.and sha…' to be '( shared.years, {"yearCount":2}, 2 sh…' // Object.is equality

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:96:7
   if (period.year) {
     periodText += t("shared.years", { yearCount: period.year }, period.year);
   }
-  if (!props.doesShowYearOnly) {
+  if (true) {
     if (period.month && period.year) {
       periodText += ` ${t("shared.and")} `;
killedBy: Period Timeline Component Periods Period should display years only when does show year only is true.
statusReason: expected '( shared.years, {"yearCount":2}, 2 sh…' to be '( shared.years, {"yearCount":2}, 2 )' // Object.is equality

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:96:7
   if (period.year) {
     periodText += t("shared.years", { yearCount: period.year }, period.year);
   }
-  if (!props.doesShowYearOnly) {
+  if (false) {
     if (period.month && period.year) {
       periodText += ` ${t("shared.and")} `;
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:97:9
     periodText += t("shared.years", { yearCount: period.year }, period.year);
   }
   if (!props.doesShowYearOnly) {
-    if (period.month && period.year) {
+    if (true) {
       periodText += ` ${t("shared.and")} `;
     }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:97:38
     periodText += t("shared.years", { yearCount: period.year }, period.year);
   }
   if (!props.doesShowYearOnly) {
-    if (period.month && period.year) {
-      periodText += ` ${t("shared.and")} `;
-    }
+    if (period.month && period.year) {}
     if (period.month) {
       periodText += t("shared.months", { monthCount: period.month });
killedBy: Period Timeline Component Periods Period should display period formatted label when started at and finished at are provided in props.
statusReason: expected '( shared.years, {"yearCount":2}, 2sha…' to be '( shared.years, {"yearCount":2}, 2 sh…' // Object.is equality

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:100:23
     if (period.month && period.year) {
       periodText += ` ${t("shared.and")} `;
     }
-    if (period.month) {
-      periodText += t("shared.months", { monthCount: period.month });
-    }
+    if (period.month) {}
   }
   return `( ${periodText} )`;
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:100:9
     if (period.month && period.year) {
       periodText += ` ${t("shared.and")} `;
     }
-    if (period.month) {
+    if (true) {
       periodText += t("shared.months", { monthCount: period.month });
     }
killedBy: Period Timeline Component Periods Period should display only years when started at and finished at are exactly one year apart.
statusReason: expected '( shared.years, {"yearCount":1}, 1sha…' to be '( shared.years, {"yearCount":1}, 1 )' // Object.is equality

[Killed] AssignmentOperator
components/shared/Period/PeriodTimeline.vue:101:7
       periodText += ` ${t("shared.and")} `;
     }
     if (period.month) {
-      periodText += t("shared.months", { monthCount: period.month });
+      periodText -= t("shared.months", {
+  monthCount: period.month
+});
     }
   }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ObjectLiteral
components/shared/Period/PeriodTimeline.vue:101:40
       periodText += ` ${t("shared.and")} `;
     }
     if (period.month) {
-      periodText += t("shared.months", { monthCount: period.month });
+      periodText += t("shared.months", {});
     }
   }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] StringLiteral
components/shared/Period/PeriodTimeline.vue:104:10
       periodText += t("shared.months", { monthCount: period.month });
     }
   }
-  return `( ${periodText} )`;
+  return ``;
 });
 
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:107:51
   return `( ${periodText} )`;
 });
 
-const formattedStartedAt = computed<string>(() => {
-  const { startedAt, doesShowYearOnly } = props;
-  if (!startedAt) {
-    return "";
-  }
-  const startedAtMonth = getMonthFullName(startedAt);
-  const startedAtYear = startedAt.getFullYear().toString();
-
-  return doesShowYearOnly ? startedAtYear : `${startedAtMonth} ${startedAtYear}`;
-});
+const formattedStartedAt = computed<string>(() => {});
 
 const formattedFinishedAt = computed<string>(() => {
killedBy: Period Timeline Component Periods Arrow up icon should display arrow up icon when period has two dates.
statusReason: expected false to be truthy

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:109:7
 
 const formattedStartedAt = computed<string>(() => {
   const { startedAt, doesShowYearOnly } = props;
-  if (!startedAt) {
+  if (false) {
     return "";
   }
killedBy: Period Timeline Component Periods Started at date should not display started at date when it is not provided in props.
statusReason: expected undefined to be '' // Object.is equality

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:109:19
 
 const formattedStartedAt = computed<string>(() => {
   const { startedAt, doesShowYearOnly } = props;
-  if (!startedAt) {
-    return "";
-  }
+  if (!startedAt) {}
   const startedAtMonth = getMonthFullName(startedAt);
   const startedAtYear = startedAt.getFullYear().toString();
killedBy: Period Timeline Component Periods Started at date should not display started at date when it is not provided in props.
statusReason: expected undefined to be '' // Object.is equality

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:118:52
   return doesShowYearOnly ? startedAtYear : `${startedAtMonth} ${startedAtYear}`;
 });
 
-const formattedFinishedAt = computed<string>(() => {
-  const { finishedAt, doesShowYearOnly } = props;
-  if (finishedAt) {
-    const finishedAtYear = finishedAt.getFullYear().toString();
-
-    return doesShowYearOnly ? finishedAtYear : `${getMonthFullName(finishedAt)} ${finishedAtYear}`;
-  }
-  return t("shared.today");
-});
+const formattedFinishedAt = computed<string>(() => {});
 
 const doesPeriodHaveTwoDates = computed<boolean>(() => !!formattedStartedAt.value);
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:120:19
 
 const formattedFinishedAt = computed<string>(() => {
   const { finishedAt, doesShowYearOnly } = props;
-  if (finishedAt) {
-    const finishedAtYear = finishedAt.getFullYear().toString();
-
-    return doesShowYearOnly ? finishedAtYear : `${getMonthFullName(finishedAt)} ${finishedAtYear}`;
-  }
+  if (finishedAt) {}
   return t("shared.today");
 });
killedBy: Period Timeline Component Periods Finished at date should display finished at formatted label when finished at is provided in props.
statusReason: expected 'shared.today' to be 'janvier 2022' // Object.is equality

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:120:7
 
 const formattedFinishedAt = computed<string>(() => {
   const { finishedAt, doesShowYearOnly } = props;
-  if (finishedAt) {
+  if (true) {
     const finishedAtYear = finishedAt.getFullYear().toString();
 
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
components/shared/Period/PeriodTimeline.vue:128:50
   return t("shared.today");
 });
 
-const doesPeriodHaveTwoDates = computed<boolean>(() => !!formattedStartedAt.value);
+const doesPeriodHaveTwoDates = computed<boolean>(() => undefined);
 
 const periodDatesAriaLabel = computed<string>(() => {
killedBy: Period Timeline Component Periods Arrow up icon should display arrow up icon when period has two dates.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
components/shared/Period/PeriodTimeline.vue:128:57
   return t("shared.today");
 });
 
-const doesPeriodHaveTwoDates = computed<boolean>(() => !!formattedStartedAt.value);
+const doesPeriodHaveTwoDates = computed<boolean>(() => !formattedStartedAt.value);
 
 const periodDatesAriaLabel = computed<string>(() => {
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:130:53
 
 const doesPeriodHaveTwoDates = computed<boolean>(() => !!formattedStartedAt.value);
 
-const periodDatesAriaLabel = computed<string>(() => {
-  const { startedAt } = props;
-  if (props.periodDatesAriaLabel !== undefined) {
-    return props.periodDatesAriaLabel;
-  }
-  if (startedAt) {
-    return t("PeriodTimeline.periodDatesAriaLabel", {
-      startedAt: formattedStartedAt.value,
-      finishedAt: formattedFinishedAt.value,
-    });
-  }
-  return t("PeriodTimeline.obtainedAtAriaLabel", {
-    obtainedAt: formattedFinishedAt.value,
-  });
-});
+const periodDatesAriaLabel = computed<string>(() => {});
 </script>
 
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:132:49
 
 const periodDatesAriaLabel = computed<string>(() => {
   const { startedAt } = props;
-  if (props.periodDatesAriaLabel !== undefined) {
-    return props.periodDatesAriaLabel;
-  }
+  if (props.periodDatesAriaLabel !== undefined) {}
   if (startedAt) {
     return t("PeriodTimeline.periodDatesAriaLabel", {
killedBy: Period Timeline Component Periods Aria Label should set aria label from props when defined in props.
statusReason: expected 'PeriodTimeline.obtainedAtAriaLabel, {…' to be 'aria-label' // Object.is equality

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:132:7
 
 const periodDatesAriaLabel = computed<string>(() => {
   const { startedAt } = props;
-  if (props.periodDatesAriaLabel !== undefined) {
+  if (true) {
     return props.periodDatesAriaLabel;
   }
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
components/shared/Period/PeriodTimeline.vue:135:18
   if (props.periodDatesAriaLabel !== undefined) {
     return props.periodDatesAriaLabel;
   }
-  if (startedAt) {
-    return t("PeriodTimeline.periodDatesAriaLabel", {
-      startedAt: formattedStartedAt.value,
-      finishedAt: formattedFinishedAt.value,
-    });
-  }
+  if (startedAt) {}
   return t("PeriodTimeline.obtainedAtAriaLabel", {
     obtainedAt: formattedFinishedAt.value,
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ConditionalExpression
components/shared/Period/PeriodTimeline.vue:135:7
   if (props.periodDatesAriaLabel !== undefined) {
     return props.periodDatesAriaLabel;
   }
-  if (startedAt) {
+  if (false) {
     return t("PeriodTimeline.periodDatesAriaLabel", {
       startedAt: formattedStartedAt.value,
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] StringLiteral
components/shared/Period/PeriodTimeline.vue:141:12
       finishedAt: formattedFinishedAt.value,
     });
   }
-  return t("PeriodTimeline.obtainedAtAriaLabel", {
+  return t("", {
     obtainedAt: formattedFinishedAt.value,
   });
killedBy: Period Timeline Component should match snapshot when rendered.
statusReason: Snapshot `Period Timeline Component > should match snapshot when rendered. 1` mismatched
