[Killed] BlockStatement
app/models/period/period.class.ts:6:44
 
   public year: number;
 
-  public constructor(from: Date, to: Date) {
-    const firstMonth = 1;
-    const monthsInYear = 12;
-    this.month = Period.getMonthsDifference(from, to) + firstMonth;
-    this.year = Math.floor(this.month / monthsInYear);
-    this.month -= this.year * monthsInYear;
-  }
+  public constructor(from: Date, to: Date) {}
 
   private static getMonthsDifference(from: Date, to: Date): number {
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ArithmeticOperator
app/models/period/period.class.ts:9:18
   public constructor(from: Date, to: Date) {
     const firstMonth = 1;
     const monthsInYear = 12;
-    this.month = Period.getMonthsDifference(from, to) + firstMonth;
+    this.month = Period.getMonthsDifference(from, to) - firstMonth;
     this.year = Math.floor(this.month / monthsInYear);
     this.month -= this.year * monthsInYear;
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ArithmeticOperator
app/models/period/period.class.ts:10:28
     const firstMonth = 1;
     const monthsInYear = 12;
     this.month = Period.getMonthsDifference(from, to) + firstMonth;
-    this.year = Math.floor(this.month / monthsInYear);
+    this.year = Math.floor(this.month * monthsInYear);
     this.month -= this.year * monthsInYear;
   }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] AssignmentOperator
app/models/period/period.class.ts:11:5
     const monthsInYear = 12;
     this.month = Period.getMonthsDifference(from, to) + firstMonth;
     this.year = Math.floor(this.month / monthsInYear);
-    this.month -= this.year * monthsInYear;
+    this.month += this.year * monthsInYear;
   }
 
killedBy: Period Timeline Component Periods Period should display period formatted label when started at and finished at are provided in props.
statusReason: expected '( shared.years, {"yearCount":2}, 2 sh…' to be '( shared.years, {"yearCount":2}, 2 sh…' // Object.is equality

[Killed] ArithmeticOperator
app/models/period/period.class.ts:11:19
     const monthsInYear = 12;
     this.month = Period.getMonthsDifference(from, to) + firstMonth;
     this.year = Math.floor(this.month / monthsInYear);
-    this.month -= this.year * monthsInYear;
+    this.month -= this.year / monthsInYear;
   }
 
killedBy: Period Timeline Component Periods Period should display period formatted label when started at and finished at are provided in props.
statusReason: expected '( shared.years, {"yearCount":2}, 2 sh…' to be '( shared.years, {"yearCount":2}, 2 sh…' // Object.is equality

[Killed] ArithmeticOperator
app/models/period/period.class.ts:17:66
   private static getMonthsDifference(from: Date, to: Date): number {
     const monthCountInYear = 12;
 
-    return to.getMonth() - from.getMonth() + monthCountInYear * (to.getFullYear() - from.getFullYear());
+    return to.getMonth() - from.getMonth() + monthCountInYear * (to.getFullYear() + from.getFullYear());
   }
 }
killedBy: Period Timeline Component Periods Started at date should match snapshot when started at date is provided in props.
statusReason: Snapshot `Period Timeline Component > Periods > Started at date > should match snapshot when started at date is provided in props. 1` mismatched

[Killed] ArithmeticOperator
app/models/period/period.class.ts:17:12
   private static getMonthsDifference(from: Date, to: Date): number {
     const monthCountInYear = 12;
 
-    return to.getMonth() - from.getMonth() + monthCountInYear * (to.getFullYear() - from.getFullYear());
+    return to.getMonth() + from.getMonth() + monthCountInYear * (to.getFullYear() - from.getFullYear());
   }
 }
killedBy: Period Class constructor should set only month property when there are 4 months.
statusReason: expected 2 to be 4 // Object.is equality
