[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:18:14
   const siteConfig = useSiteConfig();
 
   const getAppSchemaOrgWebSite = (): ReturnType<typeof defineWebSite> => defineWebSite({
-    "@type": "WebSite",
+    "@type": "",
     // eslint-disable-next-line @typescript-eslint/no-unsafe-type-assertion
     "name": siteConfig.name as string,
killedBy: Use App Schema Org Composable getAppSchemaOrgWebSite should get app schema org website when called.
statusReason: expected { '@type': '', …(4) } to strictly equal { '@type': 'WebSite', …(4) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:26:14
   });
 
   const getAppSchemaOrgPerson = (): ReturnType<typeof definePerson> => definePerson({
-    "@type": "Person",
+    "@type": "",
     "address": {
       "@type": "PostalAddress",
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': '', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] ObjectLiteral
app/composables/useAppSchemaOrg.ts:27:16
 
   const getAppSchemaOrgPerson = (): ReturnType<typeof definePerson> => definePerson({
     "@type": "Person",
-    "address": {
-      "@type": "PostalAddress",
-      "addressLocality": config.public.address,
-      "addressCountry": t("Countries.france"),
-    },
+    "address": {},
     "alumniOf": {
       "@type": "CollegeOrUniversity",
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:28:16
   const getAppSchemaOrgPerson = (): ReturnType<typeof definePerson> => definePerson({
     "@type": "Person",
     "address": {
-      "@type": "PostalAddress",
+      "@type": "",
       "addressLocality": config.public.address,
       "addressCountry": t("Countries.france"),
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:30:27
     "address": {
       "@type": "PostalAddress",
       "addressLocality": config.public.address,
-      "addressCountry": t("Countries.france"),
+      "addressCountry": t(""),
     },
     "alumniOf": {
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] ObjectLiteral
app/composables/useAppSchemaOrg.ts:32:17
       "addressLocality": config.public.address,
       "addressCountry": t("Countries.france"),
     },
-    "alumniOf": {
-      "@type": "CollegeOrUniversity",
-      "name": "EPITECH",
-      "url": "https://www.epitech.eu/",
-    },
+    "alumniOf": {},
     "award": [
       t("Degrees.highSchoolDiploma"),
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] ArrayDeclaration
app/composables/useAppSchemaOrg.ts:37:14
       "name": "EPITECH",
       "url": "https://www.epitech.eu/",
     },
-    "award": [
-      t("Degrees.highSchoolDiploma"),
-      t("Degrees.ITCertification"),
-      t("Degrees.ITMasterDegree"),
-      t("Degrees.CKAD"),
-      t("Degrees.gcpACE"),
-    ],
+    "award": [],
     "birthDate": ANTOINE_ZANARDI_BIRTH_DATE,
     "description": t("App.meta.smallDescription"),
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:39:9
     },
     "award": [
       t("Degrees.highSchoolDiploma"),
-      t("Degrees.ITCertification"),
+      t(""),
       t("Degrees.ITMasterDegree"),
       t("Degrees.CKAD"),
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:42:9
       t("Degrees.ITCertification"),
       t("Degrees.ITMasterDegree"),
       t("Degrees.CKAD"),
-      t("Degrees.gcpACE"),
+      t(""),
     ],
     "birthDate": ANTOINE_ZANARDI_BIRTH_DATE,
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:49:16
     "email": config.public.email,
     "gender": "Male",
     "hasOccupation": {
-      "@type": "Occupation",
+      "@type": "",
       "name": t("MyProfile.itConsultant"),
       "description": t("MyProfile.fullStackWebExpert"),
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:61:9
       t("MySkills.javascript"),
       t("MySkills.typescript"),
       t("MySkills.vue"),
-      t("MySkills.nuxt"),
+      t(""),
       t("MySkills.mysql"),
       t("MySkills.mongodb"),
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] ArrayDeclaration
app/composables/useAppSchemaOrg.ts:66:22
       t("MySkills.mongodb"),
       t("MySkills.rust"),
     ],
-    "knowsLanguage": [
-      {
-        "@type": "Language",
-        "name": t("Languages.french"),
-        "alternateName": "fr",
-      },
-      {
-        "@type": "Language",
-        "name": t("Languages.english"),
-        "alternateName": "en",
-      },
-    ],
+    "knowsLanguage": [],
     "name": ANTOINE_ZANARDI_FULL_NAME,
     "nationality": {
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:70:26
       {
         "@type": "Language",
         "name": t("Languages.french"),
-        "alternateName": "fr",
+        "alternateName": "",
       },
       {
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] ArrayDeclaration
app/composables/useAppSchemaOrg.ts:83:15
       "@type": "Country",
       "name": t("Countries.france"),
     },
-    "sameAs": [
-      ANTOINE_ZANARDI_LINKEDIN_URL,
-      ANTOINE_ZANARDI_GITHUB_URL,
-    ],
+    "sameAs": [],
     "subjectOf": {
       "@type": "CreativeWork",
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] StringLiteral
app/composables/useAppSchemaOrg.ts:96:16
     "telephone": config.public.phoneNumber,
     "url": siteConfig.url,
     "worksFor": {
-      "@type": "Organization",
+      "@type": "",
       "name": "Daveo",
       "url": "https://www.daveo.fr/",
killedBy: Use App Schema Org Composable getAppSchemaOrgPerson should get app schema org person when called.
statusReason: expected { '@type': 'Person', …(20) } to strictly equal { '@type': 'Person', …(20) }

[Killed] BlockStatement
app/composables/useAppSchemaOrg.ts:102:41
     },
   });
 
-  const setupAppSchemaOrg = (): void => {
-    useSchemaOrg([
-      getAppSchemaOrgWebSite(),
-      getAppSchemaOrgPerson(),
-    ]);
-  };
+  const setupAppSchemaOrg = (): void => {};
   return {
     getAppSchemaOrgWebSite,
killedBy: Use App Schema Org Composable setupAppSchemaOrg should setup app schema org when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
