[Killed] BlockStatement
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:193:36
 
 const config = useRuntimeConfig();
 
-const age = computed<number>(() => {
-  const birthday = new Date("1996-04-14");
-  const epochYear = 1970;
-
-  return new Date(Date.now() - birthday.getTime()).getUTCFullYear() - epochYear;
-});
+const age = computed<number>(() => {});
 
 const formattedPhoneNumber = computed<string>(() => {
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:194:29
 const config = useRuntimeConfig();
 
 const age = computed<number>(() => {
-  const birthday = new Date("1996-04-14");
+  const birthday = new Date("");
   const epochYear = 1970;
 
killedBy: AboutMyPersonalInfo Component should match snapshot when rendered.
statusReason: Snapshot `AboutMyPersonalInfo Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
components/AboutMe/AboutMyPersonalInfo/AboutMyPersonalInfo.vue:203:40
 const formattedPhoneNumber = computed<string>(() => {
   const matches = config.public.phoneNumber.match(/.{2}/gu);
 
-  return matches ? matches.join(" ") : "?";
+  return matches ? matches.join(" ") : "";
 });
 </script>
killedBy: AboutMyPersonalInfo Component Phone Number should render ? when phone number in runtime config doesn't have a correct format.
statusReason: expected '' to be '?' // Object.is equality
