[Killed] ObjectLiteral
app/components/MyPortfolio/MyPortfolio.vue:49:3
 
 const i18nProjectPath = "MyPortfolio.projects";
 const projects: Project[] = [
-  {
-    name: t(`${i18nProjectPath}.portfolio.name`),
-    description: t(`${i18nProjectPath}.portfolio.description`),
-    image: "portfolio-thumbnail.webp",
-    url: "https://www.antoinezanardi.fr",
-  },
+  {},
   {
     name: t(`${i18nProjectPath}.werewolvesAssistant.name`),
killedBy: My Portfolio Component Projects should render my portfolio project when rendered.
statusReason: expected {} to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:52:12
   {
     name: t(`${i18nProjectPath}.portfolio.name`),
     description: t(`${i18nProjectPath}.portfolio.description`),
-    image: "portfolio-thumbnail.webp",
+    image: "",
     url: "https://www.antoinezanardi.fr",
   },
killedBy: My Portfolio Component Projects should render my portfolio project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:56:13
     url: "https://www.antoinezanardi.fr",
   },
   {
-    name: t(`${i18nProjectPath}.werewolvesAssistant.name`),
+    name: t(``),
     description: t(`${i18nProjectPath}.werewolvesAssistant.description`),
     image: "werewolves-assistant-thumbnail.webp",
killedBy: My Portfolio Component Projects should render my Werewolves Assistant project when rendered.
statusReason: expected { name: '', …(3) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:59:10
     name: t(`${i18nProjectPath}.werewolvesAssistant.name`),
     description: t(`${i18nProjectPath}.werewolvesAssistant.description`),
     image: "werewolves-assistant-thumbnail.webp",
-    url: "https://werewolves-assistant.com",
+    url: "",
   },
   {
killedBy: My Portfolio Component Projects should render my Werewolves Assistant project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:62:13
     url: "https://werewolves-assistant.com",
   },
   {
-    name: t(`${i18nProjectPath}.distribution.name`),
+    name: t(``),
     description: t(`${i18nProjectPath}.distribution.description`),
     image: "distribution-thumbnail.webp",
killedBy: My Portfolio Component Projects should render book distribution project when rendered.
statusReason: expected { name: '', …(3) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:64:12
   {
     name: t(`${i18nProjectPath}.distribution.name`),
     description: t(`${i18nProjectPath}.distribution.description`),
-    image: "distribution-thumbnail.webp",
+    image: "",
     url: "https://www.airvey-editions.fr",
   },
killedBy: My Portfolio Component Projects should render book distribution project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }

[Killed] StringLiteral
app/components/MyPortfolio/MyPortfolio.vue:70:12
   {
     name: t(`${i18nProjectPath}.gitHub.name`),
     description: t(`${i18nProjectPath}.gitHub.description`),
-    image: "github.webp",
+    image: "",
     url: "https://github.com/antoinezanardi",
   },
killedBy: My Portfolio Component Projects should render my GitHub profile project when rendered.
statusReason: expected { …(4) } to strictly equal { …(4) }
