[Killed] BooleanLiteral
app/components/NavBar/NavBar.vue:99:46
 </template>
 
 <script lang="ts" setup>
-const isMobileNavBarCollapsed = ref<boolean>(true);
+const isMobileNavBarCollapsed = ref<boolean>(false);
 
 function onClickFromNavBarToggler(): void {
killedBy: NavBar Component should match snapshot when rendered.
statusReason: Snapshot `NavBar Component > should match snapshot when rendered. 1` mismatched
